Documents/ВыплатыСамозанятым.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ВыплатыСамозанятым</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСПрочимиКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыИРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетаУчетаЗатратВТаблице</Name>
					<Comment>АПК:58 Документ перенесен из БП</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаВТаблице</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>АПК:58 Документ перенесен из БП</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Comment>АПК:58 Документ перенесен из БП</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корреспонденция</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Выплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>АПК:58 Документ перенесен из БП</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>АПК:58 Документ перенесен из БП</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаНаЧек</Name>
							<Comment>Ссылка на чек на сайте ФНС</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерЧека</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧекСамозанятого</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВыплатыСамозанятымПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтказа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПричиныОтказаВЧекахВыплатСамозанятым</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасшифровкаРезультата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовВыплатыСамозанятым</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыПлатежногоПоручения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПоступленияПоСчету</v8:Type>
						<v8:Type>cfg:EnumRef.СтатусыОтгрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусСчетаФактуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСчетаФактуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСчетаФактуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыплатыСамозанятым</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеДСПлан</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходДСПлан</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПользователей</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыСПрочимиКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПрочимиКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СодержаниеПроводки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Управленческий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Comment>АПК:1208</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВыплатыСамозанятым</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыДокументовВыплатыСамозанятым.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>СтатусыДокументовВыплатыСамозанятым</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выгружено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноОплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекиЗагружены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧекиЧастичноЗагружены</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийРасходСоСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходСоСчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Покупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыНаПлатежныеКарты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРасходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеНаличных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗарплатаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичныеСредстваПредпринимателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПродажиВКредит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомиссияБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НашейОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатыСамозанятым</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаСамозанятому</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВыплатыСамозанятым/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ГруппаКоманднаяПанель;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	НациональнаяВалюта = УправлениеНебольшойФирмойПовтИсп.ПолучитьНациональнуюВалюту();
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
		ДокументыУНФ.ПолучитьНастройкиБыстрыхФорм(ЭтотОбъект);
	КонецЕсли;
	
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если Не ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = ТекущаяДатаСеанса();
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ИспользоватьНесколькоБанковскихСчетовОрганизации =
			УчетДенежныхСредствПовтИсп.ИспользуетсяНесколькоБанковскихСчетовОрганизации(Объект.Организация);
	Иначе
		ИспользоватьНесколькоБанковскихСчетовОрганизации = Истина;
	КонецЕсли;
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Документы.ВыплатыСамозанятым);
	Элементы.ФормаВыгрузитьРеестр.Видимость = МожноРедактировать;
	
	КоманднаяПанельПодменюДиректБанк = ЭтотОбъект.ПодчиненныеЭлементы.ГруппаКоманднаяПанель.ПодчиненныеЭлементы.Найти("ПодменюДиректБанк");
	Если КоманднаяПанельПодменюДиректБанк <> Неопределено Тогда
		КоманднаяПанельПодменюДиректБанкОбычное = КоманднаяПанельПодменюДиректБанк.ПодчиненныеЭлементы.Найти("ПодменюДиректБанкОбычное");
		Если КоманднаяПанельПодменюДиректБанкОбычное <> Неопределено Тогда
			Для Каждого КнопкаФормыДБ Из КоманднаяПанельПодменюДиректБанкОбычное.ПодчиненныеЭлементы Цикл
				КнопкаФормыДБ.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВДополнительномПодменю;
			КонецЦикла;
		КонецЕсли;		
		Элементы.Переместить(КоманднаяПанельПодменюДиректБанк, Элементы.ГруппаКоманднаяПанель);
	КонецЕсли;
	
	ИзменитьПараметрыВыбораСчетаОрганизации();
	
	НастройкиКоличества = ПолучитьНастройкиИзмененияКоличества();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиКоличества);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполненаЗаписьДокумента" Тогда
		Если Объект.Ссылка = Параметр.ДокументСсылка Тогда 
			Прочитать();
		КонецЕсли;
	КонецЕсли;
	
	Если (ИмяСобытия = "ЗагрузкаЧековСамозанятых" И Источник = Объект.Ссылка)
			ИЛИ (ИмяСобытия = "ОбновитьСостояниеВыплатыСамозанятым")
			ИЛИ (ИмяСобытия = "ОбновитьСостояниеОбменСБанками") Тогда
				ПрочитатьДокументИОбновитьСостояние();
	КонецЕсли;
	
	Если ИмяСобытия = "ИзменениеВыписки" Тогда
		Прочитать();
	ИначеЕсли ИмяСобытия = "ИзмененБанковскийСчет" Тогда
		Если Параметр.Владелец = Объект.Организация Тогда
			СчетОрганизацииПриИзмененииНаСервере();
			Модифицированность = Истина;
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "Запись_Организации" Тогда
		Если Источник = Объект.Организация Тогда
			ОрганизацияПриИзмененииНаСервере();
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ИмяСобытия = "Выбор_Контрагент" Тогда
		Если Источник.ВладелецФормы = Неопределено Тогда
			Возврат;
		КонецЕсли;
		Если Источник.ВладелецФормы = Элементы.Выплаты Тогда
			Для Каждого ЭлементКонтрагент Из Параметр.Контрагент Цикл
				Элементы.Выплаты.ДобавитьСтроку();
				Элементы.Выплаты.ТекущиеДанные.Контрагент = ЭлементКонтрагент;
				ВыплатыКонтрагентПриИзменении(Неопределено);
			КонецЦикла;	
			Модифицированность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ДокументыУНФ.ПолучитьНастройкиБыстрыхФорм(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	СтатусЗагрузкиЧеков = Документы.ВыплатыСамозанятым.СтатусЗагрузкиЧеков(Объект.Ссылка);
	// Приведенное состояние учитывает ручное изменение состояния документа и статуса загрузки чеков
	ПриведенноеСостояние = Документы.ВыплатыСамозанятым.СтатусЗагрузкиЧековПриведенный(СтатусЗагрузкиЧеков);
	Если Не ПриведенноеСостояние.Пустая() Тогда
		Состояние = ПриведенноеСостояние;
	КонецЕсли;
	УстановитьСтатусДокумента(Состояние);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
	УстановитьСостояниеДокумента();
	
	Состояние = СостояниеДокумента(Объект.Ссылка);
	
	ЗаполнитьФлагОплачено();
	
	ПараметрыЗаписи.Вставить("СостояниеВыплатыСамозанятымПосле", Состояние);
	СостояниеИзмененоВручную = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Оповестить("Запись_ВыплатыСамозанятым", ПараметрыЗаписи, Объект.Ссылка);
	
	Если ПараметрыЗаписи.СостояниеВыплатыСамозанятымДо <> ПараметрыЗаписи.СостояниеВыплатыСамозанятымПосле Тогда
		Оповестить("ИзменилосьСостояниеДокументаВыплатыСамозанятым", Неопределено, Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если СостояниеИзмененоВручную Тогда
		ТекущийОбъект.ДополнительныеСвойства.Вставить("Состояние", Состояние);
	КонецЕсли;
	КоллекцияСтатусов = РегистрыСведений.СтатусыДокументов.ПолучитьСтатусыДокументов(
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ТекущийОбъект.Ссылка));	
	ТекущееСостояние = ?(КоллекцияСтатусов[ТекущийОбъект.Ссылка] <> Неопределено, 
		КоллекцияСтатусов[ТекущийОбъект.Ссылка].Статус, 
		Неопределено);
	ПараметрыЗаписи.Вставить("СостояниеВыплатыСамозанятымДо", ТекущееСостояние);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	
	ДополнительныеПараметры = Новый Структура("ВыплатыСамозанятым", Объект.ХозяйственнаяОперация);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	Отбор = Новый Структура;
	Отбор.Вставить("ЮридическоеФизическоеЛицо",
		ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо"));
	Отбор.Вставить("Самозанятый", Истина);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("ПрочиеОтношения", Истина);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ДополнительныеПараметры", ДополнительныеПараметры);
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ПараметрыФормы,
		Элементы.Выплаты, УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Если Модифицированность Тогда
		// Запишем изменения документа
		Записать();
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершитьЗагрузкуИзФайла", ЭтотОбъект);
	ВыплатыСамозанятымКлиент.ЗагрузитьЧеки(ОписаниеОповещения, УникальныйИдентификатор, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьРеестр(Команда)
	
	Если Модифицированность Или Объект.Ссылка.Пустая() Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru='Для выгрузки реестра в файл данные будут записаны. Продолжить?'");
		КнопкиОтвета = Новый СписокЗначений;
		КнопкиОтвета.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Записать и продолжить'"));
		КнопкиОтвета.Добавить(КодВозвратаДиалога.Отмена);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, КнопкиОтвета);
	Иначе
		ВыгрузитьПродолжение();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСбросаКоличества(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("СтрокаПоиска", НСтр("ru = 'Сбрасывать количество при изменении номенклатуры'"));
	Оповещение = Новый ОписаниеОповещения("НастройкаСбросаКоличестваЗавершение", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.НастройкиПользователей.Форма.ФормаНастройкиПользователя", СтруктураПараметров, , , , ,
		Оповещение);
	
	СтатистикаИспользованияФормКлиент.ПриИнтерактивномДействии(ЭтотОбъект, 
		Элементы.ВыплатыКонтекстноеМенюНастройкаСбросаКоличества, "Нажатие");
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСбросаКоличестваЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	НастройкиКоличества = ПолучитьНастройкиИзмененияКоличества();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиКоличества);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	ДанныеДляИзмененияДаты = ДокументыУНФКлиент.ДанныеДляИзмененияДаты(ЭтотОбъект, Объект);
	Если ДанныеДляИзмененияДаты.ДатаНеМенялась Тогда
		Возврат;
	КонецЕсли;
	
	ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ОрганизацияПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УказаниеУслугиПриИзменении(Элемент)
	
	ПредыдущееЗначение = Объект.УслугаВТаблице;
	Объект.УслугаВТаблице = (УказаниеУслуги = "ВСписке");
	
	УправлениеФормой(ЭтотОбъект);
	
	Если ПредыдущееЗначение = Объект.УслугаВТаблице Или Объект.Выплаты.Количество() = 0 Тогда
		// Ничего делать не нужно
		Возврат;
	КонецЕсли;
		
	Если Объект.УслугаВТаблице Тогда
		// Заполним услугу в таблице
		Данные = ДанныеНоменклатуры(ЭтотОбъект);
		Данные.Номенклатура = Объект.Номенклатура;
		НоменклатураПриИзмененииНаСервере(Данные);
		Для Каждого СтрокаТаблицы Из Объект.Выплаты Цикл
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, Данные, , "Цена");
		КонецЦикла;
		Объект.Номенклатура = Неопределено;
	Иначе
		// Установим первую номенклатуру в качестве основной
		Объект.Номенклатура = Объект.Выплаты[0].Номенклатура;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Данные = ДанныеНоменклатуры(ЭтотОбъект);
	Данные.Номенклатура = Объект.Номенклатура;
	
	НоменклатураПриИзмененииНаСервере(Данные);
	ЦенаНоменклатуры = Данные.Цена;
	
	Если ЦенаНоменклатуры = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Выплаты.Итог("Сумма") <> 0  Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнениеЦеныНоменклатурыЗавершение", ЭтотОбъект, Новый Структура);
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить(КодВозвратаДиалога.Да, НСтр("ru='Заполнить'"));
		Кнопки.Добавить(КодВозвратаДиалога.Отмена, НСтр("ru='Нет'"));
		ПоказатьВопрос(ОписаниеОповещения,
			НСтр("ru='Заполнить цену услуги в строках?'"),
			Кнопки);
	ИначеЕсли Объект.Выплаты.Количество() <> 0 Тогда
		ЗаполнитьЦенуНоменклатурыНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуНоменклатурыВДокументах Тогда
		Возврат
	КонецЕсли;
	
	БыстрыеФормыУНФКлиент.НоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуНоменклатурыВДокументах Тогда
		Возврат
	КонецЕсли;
	
	БыстрыеФормыУНФКлиент.НоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
		Возврат
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Если ВыбранноеЗначение.Свойство("БыстроеСоздание") Тогда
			БыстрыеФормыУНФКлиент.ОткрытьБыструюФормуНоменклатуры(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
			Возврат
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСтрокЧековПриИзменении(Элемент)
	
	УстановитьОтборСтрок(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетОрганизацииПриИзменении(Элемент)
	
	СчетОрганизацииПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОбменСБанкамиКлиент.ОткрытьАктуальныйЭД(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокВыбора = Новый СписокЗначений;
	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыДокументовВыплатыСамозанятым.Подготовлено"));
	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыДокументовВыплатыСамозанятым.Выгружено"));
	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыДокументовВыплатыСамозанятым.ЧастичноОплачено"));
	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыДокументовВыплатыСамозанятым.Оплачено"));
	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыДокументовВыплатыСамозанятым.ЧекиЧастичноЗагружены"));
	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыДокументовВыплатыСамозанятым.ЧекиЗагружены"));
	СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.СтатусыДокументовВыплатыСамозанятым.Отклонено"));
	ДанныеВыбора = СписокВыбора;
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)
	
	СостояниеИзмененоВручную = Истина;
	ПриИзмененииСостоянияНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОплатыНажатие(Элемент, СтандартнаяОбработка)
	
	Если Не ОплатаВсегоРеестра Тогда
		СтандартнаяОбработка = Ложь;
		Отбор = Новый Структура("РеестрВыплатСамозанятым", Объект.Ссылка);
		ОткрытьФорму(
			"Документ.РасходСоСчета.ФормаСписка", 
			Новый Структура("Отбор", Отбор),
			ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КорреспонденцияПриИзменении(Элемент)
	
	ОбновитьРеквизитыВидимостиФормы();
	
	УправлениеФормой(ЭтотОбъект);
	// Объект.АналитикаПрочихДоходовИРасходов = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыплаты

&НаКлиенте
Процедура ВыплатыПриИзменении(Элемент)
	
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыКонтрагентПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Выплаты.ТекущиеДанные;
	
	ДанныеСтроки = Новый Структура;
	ДанныеСтроки.Вставить("Контрагент", ТекущиеДанные.Контрагент);
	ДанныеСтроки.Вставить("БанковскийСчет");
	ДанныеСтроки.Вставить("Договор");
	
	ВыплатыКонтрагентПриИзмененииНаСервере(ДанныеСтроки);
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, ДанныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыКонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуКонтрагентовВДокументах Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыПолученияДанных.Вставить("ВидОперации", "ВыплатыСамозанятым");
	БыстрыеФормыУНФКлиент.КонтрагентАвтоПодбор(
		Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыКонтрагентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуКонтрагентовВДокументах Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыПолученияДанных.Вставить("ВидОперации", "ВыплатыСамозанятым");
	БыстрыеФормыУНФКлиент.КонтрагентОкончаниеВводаТекста(
		Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыКонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуКонтрагентовВДокументах Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыОбъекта = Новый Структура("ВидОперации", "ВыплатыСамозанятым");
	БыстрыеФормыУНФКлиент.ОткрытьБыструюФормуКонтрагента(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, ПараметрыОбъекта, Истина);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыплатыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТипВыбранногоЗначения = ТипЗнч(ВыбранноеЗначение);
	Если ТипВыбранногоЗначения = Тип("СправочникСсылка.Контрагенты") Тогда
		
		НоваяСтрока = Объект.Выплаты.Добавить();
		НоваяСтрока.Контрагент = ВыбранноеЗначение;
		
		ДанныеСтроки = Новый Структура;
		ДанныеСтроки.Вставить("Контрагент", НоваяСтрока.Контрагент);
		ДанныеСтроки.Вставить("БанковскийСчет");
		ДанныеСтроки.Вставить("Договор");
		
		ВыплатыКонтрагентПриИзмененииНаСервере(ДанныеСтроки);
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСтроки);
		
		Если Не Объект.УслугаВТаблице И ЦенаНоменклатуры <> 0 Тогда
			НоваяСтрока.Цена = ЦенаНоменклатуры;
			НоваяСтрока.Сумма = ЦенаНоменклатуры;
			НоваяСтрока.Количество = 1;
		КонецЕсли;
		ОбновитьИтоги(ЭтотОбъект);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыплатыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ВыплатыЧекСамозанятого" Или Поле.Имя = "ВыплатыЗагрузитьЧекСамозанятого" Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.Выплаты.ТекущиеДанные;
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ОткрытиеФормыЧекаСамозанятогоЗавершение", 
			ЭтотОбъект,
			Новый Структура("ТекущиеДанные", ТекущиеДанные));
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СсылкаНаЧек", ТекущиеДанные.СсылкаНаЧек);
		ПараметрыФормы.Вставить("НомерЧека", ТекущиеДанные.НомерЧека);
		ПараметрыФормы.Вставить("ЧекСамозанятого", ТекущиеДанные.ЧекСамозанятого);
		ПараметрыФормы.Вставить("РеестрВыплатСамозанятым", Объект.Ссылка);
		ОткрытьФорму("Документ.ВыплатыСамозанятым.Форма.ФормаЧекаСамозанятого", 
			ПараметрыФормы,
			,
			,
			,
			,
			ОписаниеОповещения,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли Поле.Имя = "ВыплатыРасшифровкаРезультата" Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.Выплаты.ТекущиеДанные;
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Самозанятый", ТекущиеДанные.Контрагент);
		ПараметрыФормы.Вставить("ПричинаОтказа", ТекущиеДанные.ПричинаОтказа);
		ПараметрыФормы.Вставить("ОшибкаБанка", Строка(ТекущиеДанные.РасшифровкаРезультата));
		ОткрытьФорму("Документ.ВыплатыСамозанятым.Форма.ФормаОшибкиЧекаСамозанятого", 
			ПараметрыФормы,
			ЭтотОбъект,
			,
			,
			,
			,
			РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыПриАктивизацииЯчейки(Элемент)
	
	Если Элементы.Выплаты.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыплатыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если Копирование Тогда
		
		Возврат;
		
	ИначеЕсли НоваяСтрока Тогда
		
		ДанныеТекущейСтроки = Элементы.Выплаты.ТекущиеДанные;
		ДанныеТекущейСтроки.Количество = НовоеКоличествоПриИзмененииНоменклатуры;
		
		Если Не Объект.УслугаВТаблице И ЦенаНоменклатуры <> 0 Тогда
			ДанныеТекущейСтроки.Цена = ЦенаНоменклатуры;
			ДанныеТекущейСтроки.Сумма = ЦенаНоменклатуры;
			ДанныеТекущейСтроки.Количество = 1;
			ОбновитьИтоги(ЭтотОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если ОтменаРедактирования И НоваяСтрока Тогда
		// Закроем форму редактирования строки, т.к. пользователь отменяет ввод
		Оповестить("ФормаРедактированияСтроки_Закрыть", Неопределено, ЭтотОбъект);
	КонецЕсли;
	
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Выплаты.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗапрашиватьСбросКоличества И СбрасыватьКоличество
		И СтрокаТабличнойЧасти.Количество <> НовоеКоличествоПриИзмененииНоменклатуры Тогда
		
		ДопПараметр = Новый Структура();
		ДопПараметр.Вставить("Элемент", Элемент);
		ДопПараметр.Вставить("Количество", СтрокаТабличнойЧасти.Количество);
		Оповещение = Новый ОписаниеОповещения("ВыплатыПодтверждениеСбросаКоличестваЗавершение", ЭтотОбъект, ДопПараметр);
		ОткрытьФорму("ОбщаяФорма.ПодтверждениеСбросаКоличества", , , , , , Оповещение);
		
	Иначе
		
		Если СбрасыватьКоличество Тогда
			НовоеКоличество = НовоеКоличествоПриИзмененииНоменклатуры;
		Иначе
			НовоеКоличество = СтрокаТабличнойЧасти.Количество;
		КонецЕсли;
		
		ВыплатыНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество);
		
	КонецЕсли;	
	
	Данные = ДанныеНоменклатуры(ЭтотОбъект);
	Данные.Номенклатура = СтрокаТабличнойЧасти.Номенклатура;
	
	НоменклатураПриИзмененииНаСервере(Данные);
	СтрокаТабличнойЧасти.Содержание = Данные.Содержание;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
		Возврат
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Если ВыбранноеЗначение.Свойство("БыстроеСоздание") Тогда
			БыстрыеФормыУНФКлиент.ОткрытьБыструюФормуНоменклатуры(Элемент, ВыбранноеЗначение, СтандартнаяОбработка);
			Возврат
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуНоменклатурыВДокументах Тогда
		Возврат
	КонецЕсли;
	
	БыстрыеФормыУНФКлиент.НоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыНоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Если НЕ ИспользоватьБыструюФормуНоменклатурыВДокументах Тогда
		Возврат
	КонецЕсли;
	
	БыстрыеФормыУНФКлиент.НоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыКоличествоПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыЦенаПриИзменении(Элемент)
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыСуммаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Выплаты.ТекущиеДанные;
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыРасчета = Новый Структура("РассчитатьЦену", Истина);
	РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ПараметрыРасчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыПодтверждениеСбросаКоличестваЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ДополнительныеПараметры.Свойство("ЭтоПодбор") И ДополнительныеПараметры.ЭтоПодбор Тогда
		
		Если Результат = Неопределено Тогда
			Возврат
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
		МассивНомеровИдентичныхСтрок = Новый Массив;
		ПолучитьЗапасыИзХранилища(ДополнительныеПараметры.АдресЗапасовВХранилище, "Выплаты", Истина, Истина, МассивНомеровИдентичныхСтрок);
		
		Для Каждого НомерСтроки Из МассивНомеровИдентичныхСтрок Цикл
			
			СтрокаТабличнойЧасти = Объект["Выплаты"][НомерСтроки];
			
			РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
			
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		ЗапрашиватьСбросКоличества = Результат.ЗапрашиватьСбросКоличества;
		Если НЕ ЗапрашиватьСбросКоличества Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Результат);
		КонецЕсли;
		Если Результат.СбрасыватьКоличество Тогда
			НовоеКоличество = Результат.НовоеКоличествоПриИзмененииНоменклатуры;
		Иначе
			НовоеКоличество = ДополнительныеПараметры.Количество;
		КонецЕсли;
	Иначе
		НовоеКоличество = ДополнительныеПараметры.Количество;
	КонецЕсли;
	
	ВыплатыНоменклатураПриИзмененииПродолжить(ДополнительныеПараметры.Элемент, НовоеКоличество);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыНоменклатураПриИзмененииПродолжить(Элемент, НовоеКоличество)

	СтрокаТабличнойЧасти = Элементы.Выплаты.ТекущиеДанные;
	
	СтрокаТабличнойЧасти.Количество = НовоеКоличество;
	
	РассчитатьСуммуВСтрокеТабличнойЧасти();
		
	ПодборНоменклатурыИзСписка = Ложь;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция УВсехСамозанятыхЗаполненИНН()
	
	Возврат Документы.ВыплатыСамозанятым.УВсехСамозанятыхЗаполненИНН(Объект.Ссылка);
	
КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	Состояние = СостояниеДокумента(Объект.Ссылка);
	
	УстановитьСостояниеДокумента();
	
	ТекущаяДатаДокумента = Объект.Дата;
	
	Объект.Корреспонденция = ПланыСчетов.Управленческий.РасчетыССамозанятыми;
	
	УказаниеУслуги = ?(Объект.УслугаВТаблице, "ВСписке", "Единая");
	Если Не Объект.УслугаВТаблице И ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		ДанныеНоменклатуры = ДанныеНоменклатуры(ЭтотОбъект);
		ДанныеНоменклатуры.Номенклатура = Объект.Номенклатура;
		НоменклатураПриИзмененииНаСервере(ДанныеНоменклатуры);
		ЦенаНоменклатуры = ДанныеНоменклатуры.Цена;
	КонецЕсли;
	
	ДокументОплаты = Документы.ВыплатыСамозанятым.ДокументОплаты(Объект.Ссылка);
	Если ЗначениеЗаполнено(ДокументОплаты) Тогда
		ОплатаВсегоРеестра = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОплаты, "ВидОперации")
			= Перечисления.ВидыОперацийРасходСоСчета.ВыплатыСамозанятым;
		Если Не ОплатаВсегоРеестра Тогда
			ДокументОплаты = СтрШаблон(НСтр("ru='%1 и другие'"), ДокументОплаты);
		КонецЕсли;
	КонецЕсли;
	
	ОтборСтрокЧеков = "Все";
	Если Параметры.Свойство("ОткрытПоСсылкеЧеков") И Параметры.ОткрытПоСсылкеЧеков 
		И Документы.ВыплатыСамозанятым.СтатусЗагрузкиЧеков(Параметры.Ключ) 
			<> Документы.ВыплатыСамозанятым.СтатусЧекиЗагружены() Тогда
		ОтборСтрокЧеков = "БезЧеков";
	КонецЕсли;
	
	УстановитьОтборСтрок(ЭтотОбъект);
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
	ЗаполнитьФлагОплачено();

	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ИспользоватьНесколькоБанковскихСчетовОрганизации =
			УчетДенежныхСредствПовтИсп.ИспользуетсяНесколькоБанковскихСчетовОрганизации(Объект.Организация);
	Иначе
		ИспользоватьНесколькоБанковскихСчетовОрганизации = Истина;
	КонецЕсли;

	ЦветОшибкиБанковскогоСчета = ЦветаСтиля.ЦветОшибкиБанковскогоСчета;
	ЦветОтсутствияОшибок = ЦветаСтиля.ЦветФонаФормы;
	
	ОсновнойБанковскийСчетОрганизацииЗаполнен = ЗначениеЗаполнено(Объект.Организация);

	ЗаполнитьОшибкуСчетаОрганизации();
	
	Если ЗначениеЗаполнено(Объект.СчетОрганизации) Тогда
		ПодключенаИнтеграцияСБанком = ЕстьНастройкаИнтеграцииСБанком();
	Иначе 
		ПодключенаИнтеграцияСБанком = Ложь;
	КонецЕсли;
	
	Элементы.ФормаВыгрузитьРеестр.Заголовок = ?(ПодключенаИнтеграцияСБанком, НСтр("ru='Отправить реестр'"),
		НСтр("ru='Выгрузить реестр'"));
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ЕстьНастройкаИнтеграцииСБанком()
	
	ЕстьНастройкаИнтеграции = Ложь;
	Банк = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.СчетОрганизации, "Банк");
	ПараметрыОбмена = ОбменСБанками.ПараметрыОбмена(Объект.Организация, Банк);
	Если ПараметрыОбмена = Неопределено Тогда
		Возврат ЕстьНастройкаИнтеграции;
	КонецЕсли;
	ЕстьНастройкаИнтеграции = ?(
		ПараметрыОбмена.ПринимаемыеВидыЭД.Найти(Перечисления.ВидыЭДОбменСБанками.РеестрВыплатСамозанятым) <> Неопределено, 
		Истина, 
		ЕстьНастройкаИнтеграции);
	Возврат ЕстьНастройкаИнтеграции;
 
КонецФункции

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ПрослеживаемостьФормыВызовСервераУНФ.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизитыВидимостиФормы()
	
	Если ЗначениеЗаполнено(Объект.Корреспонденция) Тогда
		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Корреспонденция, "АналитикаДоходовИРасходов");
		АналитикаПрочихДоходовИРасходов = ЗначенияРеквизитов.АналитикаДоходовИРасходов;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Элементы.Номенклатура.Доступность = Не Объект.УслугаВТаблице;
	Элементы.Номенклатура.АвтоОтметкаНезаполненного = Не Объект.УслугаВТаблице;
	Элементы.ВыплатыГруппаНоменклатура.Видимость = Объект.УслугаВТаблице; 
	
	ПоказатьЧеки = (Форма.Состояние = ПредопределенноеЗначение("Перечисление.СтатусыДокументовВыплатыСамозанятым.Оплачено")
		Или Форма.Состояние = ПредопределенноеЗначение("Перечисление.СтатусыДокументовВыплатыСамозанятым.ЧастичноОплачено")
		Или Форма.Состояние = ПредопределенноеЗначение("Перечисление.СтатусыДокументовВыплатыСамозанятым.ЧекиЗагружены")
		Или Форма.Состояние = ПредопределенноеЗначение("Перечисление.СтатусыДокументовВыплатыСамозанятым.ЧекиЧастичноЗагружены")
		Или Форма.Состояние = ПредопределенноеЗначение("Перечисление.СтатусыДокументовВыплатыСамозанятым.Отклонено"));
	
	Элементы.ДокументОплаты.Видимость = ЗначениеЗаполнено(Форма.ДокументОплаты);
	Элементы.ГруппаКомандыЧекиСамозанятых.Видимость = ЗначениеЗаполнено(Форма.ДокументОплаты) Или ПоказатьЧеки;
	Элементы.ВыплатыГруппаЧекСамозанятого.Видимость = ЗначениеЗаполнено(Форма.ДокументОплаты) Или ПоказатьЧеки;
	Элементы.ГруппаОтборЧеков.Видимость = ЗначениеЗаполнено(Форма.ДокументОплаты) Или ПоказатьЧеки;
	Элементы.ВыплатыОплачено.Видимость = ЗначениеЗаполнено(Форма.ДокументОплаты);
	
	Элементы.ФормаВыгрузитьРеестр.Заголовок = ?(
		Форма.ПодключенаИнтеграцияСБанком, 
		НСтр("ru='Отправить реестр'"), 
		НСтр("ru='Выгрузить реестр'"));
	
	УстановитьСвойстваПоляСостояние(Форма);
	
	ОбновитьИтоги(Форма);
	
	ОтобразитьПредупрежденияОбОшибкахСчетаОрганизации(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСвойстваПоляСостояние(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Если Форма.ТолькоПросмотр
		ИЛИ НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
			Элементы.Состояние.ТолькоПросмотр = Истина;
			Элементы.Состояние.КнопкаОткрытия = Ложь;
			Элементы.Состояние.КнопкаВыпадающегоСписка = Ложь;
	Иначе
		Если Форма.ПодключенаИнтеграцияСБанком Тогда
			Элементы.Состояние.ТолькоПросмотр = Истина;
			Элементы.Состояние.КнопкаОткрытия = Истина;
			Элементы.Состояние.КнопкаВыпадающегоСписка = Ложь;
		Иначе
			Элементы.Состояние.ТолькоПросмотр = Ложь;
			Элементы.Состояние.КнопкаОткрытия = Ложь;
			Элементы.Состояние.КнопкаВыпадающегоСписка = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьИтоги(Форма)
	
	Объект = Форма.Объект;
	Форма.Всего = Объект.Выплаты.Итог("Сумма");
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииСостоянияНаСервере()
	
	ЗаполнитьФлагОплачено();
	УправлениеФормой(ЭтотОбъект);
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
КонецПроцедуры

&НаСервере
Процедура ВыплатыКонтрагентПриИзмененииНаСервере(ДанныеСтроки)
	
	ДанныеСтроки.БанковскийСчет = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ДанныеСтроки.Контрагент, "БанковскийСчетПоУмолчанию");
	
	ДанныеСтроки.Договор = Справочники.ДоговорыКонтрагентов.ПоКонтрагентуПоОрганизации(
		ДанныеСтроки.Контрагент, Объект.Организация, Перечисления.ВидыДоговоров.Прочее);
		
	Если Не ЗначениеЗаполнено(ДанныеСтроки.Договор) Тогда
		ДанныеСтроки.Договор = Справочники.ДоговорыКонтрагентов.СоздатьПоКонтрагентуПоОрганизации(
			ДанныеСтроки.Контрагент, Объект.Организация, Перечисления.ВидыДоговоров.Прочее);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц() Экспорт
	
	Для Каждого СтрокаТабЧасти Из Объект.Выплаты Цикл
		Если ЗначениеЗаполнено(СтрокаТабЧасти.ЧекСамозанятого) И ЗначениеЗаполнено(СтрокаТабЧасти.НомерЧека) Тогда
			СтрокаТабЧасти.ЧекЗагружен = Истина;
		ИначеЕсли ЗначениеЗаполнено(СтрокаТабЧасти.НомерЧека) И Не ЗначениеЗаполнено(СтрокаТабЧасти.ЧекСамозанятого) Тогда
			СтрокаТабЧасти.ЧекЗагружен = Ложь; // Чек не прикреплен к документу
			СтрокаТабЧасти.ЗагрузитьЧекСамозанятого = НСтр("ru='Чек не прикреплен'");
		Иначе
			СтрокаТабЧасти.ЧекЗагружен = Ложь; // Чек не загружен
			СтрокаТабЧасти.ЗагрузитьЧекСамозанятого = "Загрузить";
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	// ВыплатыЗагрузитьЧекСамозанятого
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВыплатыЗагрузитьЧекСамозанятого");
	
	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		ЭлементУО.Отбор.Элементы, "ОтборВыплатыЗагрузитьЧекСамозанятого",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
		"Объект.Выплаты.ЧекСамозанятого", ВидСравненияКомпоновкиДанных.Заполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
		"Объект.Выплаты.РасшифровкаРезультата", ВидСравненияКомпоновкиДанных.Заполнено);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// ВыплатыЧекСамозанятого
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВыплатыЧекСамозанятого");
	
	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		ЭлементУО.Отбор.Элементы, "ОтборВыплатыЧекСамозанятого",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
		"Объект.Выплаты.ЧекСамозанятого", ВидСравненияКомпоновкиДанных.НеЗаполнено);
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
		"Объект.Выплаты.РасшифровкаРезультата", ВидСравненияКомпоновкиДанных.Заполнено);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// ВыплатыРасшифровкаРезультата - если есть ошибка спрячем поле
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ВыплатыРасшифровкаРезультата");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ЭлементУО.Отбор,
		"Объект.Выплаты.РасшифровкаРезультата",
		ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НоменклатураПриИзмененииНаСервере(Данные)
	
	СведенияОНоменклатуре = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Данные.Номенклатура, "НаименованиеПолное");
		
	Если СведенияОНоменклатуре = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Данные, СведенияОНоменклатуре);
	Данные.Содержание = СведенияОНоменклатуре.НаименованиеПолное;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДанныеНоменклатуры(Форма)
	
	Объект = Форма.Объект;
	
	Данные = Новый Структура;
	Данные.Вставить("Номенклатура");
	Данные.Вставить("Содержание");
	Данные.Вставить("Цена");
	ПараметрыОбъекта = Новый Структура;
	ПараметрыОбъекта.Вставить("Дата", Объект.Дата);
	ПараметрыОбъекта.Вставить("Организация", Объект.Организация);
	ПараметрыОбъекта.Вставить("ЗаполнятьЦеныПродажаИПокупка", Истина);
	Данные.Вставить("ПараметрыОбъекта", ПараметрыОбъекта);
	
	Возврат Данные;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнениеЦеныНоменклатурыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Или Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЦенуНоменклатурыНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦенуНоменклатурыНаКлиенте()
	
	Для Каждого СтрокаВыплаты Из Объект.Выплаты Цикл
		СтрокаВыплаты.Цена = ЦенаНоменклатуры;
		СтрокаВыплаты.Сумма = ЦенаНоменклатуры * ?(СтрокаВыплаты.Количество = 0, 1, СтрокаВыплаты.Количество);
	КонецЦикла;
	
	ОбновитьИтоги(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере(ДанныеДляИзмененияДаты)

	ДокументыУНФ.ДатаПриИзменении(ДанныеДляИзмененияДаты, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытиеФормыЧекаСамозанятогоЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Отмена Или Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, Результат);
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСтрок(Форма)
	
	Отбор = Новый Структура;
	Если Форма.ОтборСтрокЧеков = "БезЧеков" Тогда
		Отбор.Вставить("ЧекЗагружен", Ложь);
	ИначеЕсли Форма.ОтборСтрокЧеков = "СЧеками" Тогда
		Отбор.Вставить("ЧекЗагружен", Истина);
	КонецЕсли;
	Форма.Элементы.Выплаты.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()

	УчетДенежныхСредствСервер.УстановитьБанковскийСчет(
		Объект.СчетОрганизации,
		Объект.Организация,
		НациональнаяВалюта,
		Ложь, Ложь);
	ЗаполнитьОшибкуСчетаОрганизации();
	ИспользоватьНесколькоБанковскихСчетовОрганизации =
		УчетДенежныхСредствПовтИсп.ИспользуетсяНесколькоБанковскихСчетовОрганизации(Объект.Организация);
	ОсновнойБанковскийСчетОрганизацииЗаполнен = ЗначениеЗаполнено(Объект.Организация);
	Если ЗначениеЗаполнено(Объект.СчетОрганизации) Тогда
		ПодключенаИнтеграцияСБанком = ЕстьНастройкаИнтеграцииСБанком();
	Иначе
		ПодключенаИнтеграцияСБанком = Ложь;
	КонецЕсли;
	
	Для Каждого ДанныеСтроки Из Объект.Выплаты Цикл
		ВыплатыКонтрагентПриИзмененииНаСервере(ДанныеСтроки);
	КонецЦикла;	
		
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетаУчетаЗатратВТаблицеПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#Область ВыгрузкаВExcel

&НаКлиенте
Процедура ВыгрузитьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Записать();
	ВыгрузитьПродолжение();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПродолжение()
	
	Если ПодключенаИнтеграцияСБанком Тогда
		Если УВсехСамозанятыхЗаполненИНН() Тогда
			ИмяНужнойКоманды = "ПодменюДиректБанкОбычное__ДиректБанкОтправка";
			НужнаяКоманда = ЭтаФорма.Команды.Найти(ИмяНужнойКоманды);
			Подключаемый_ВыполнитьКоманду(НужнаяКоманда); 
		КонецЕсли;
	Иначе
		ОписаниеФайла = ПоместитьФайлВоВременноеХранилищеНаСервере();
		ТекстСообщения = НСтр("ru = 'Для сохранения файлов рекомендуется установить расширение для веб-клиента 1С:Предприятие.'");
		Обработчик = Новый ОписаниеОповещения("ВыгрузитьВФайлЗавершение", ЭтотОбъект, ОписаниеФайла);
		ОбщегоНазначенияКлиент.ПоказатьВопросОбУстановкеРасширенияРаботыСФайлами(Обработчик, ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьФайл(ИмяПапки, ИмяФайла, ЭтоВыгрузкаВCSV)
	
	ПолноеИмяФайла = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ИмяПапки) + ИмяФайла;
	
	Если ЭтоВыгрузкаВCSV Тогда
		Документы.ВыплатыСамозанятым.СохранитьРеестрДляВыгрузкиВCSV(ПолноеИмяФайла, Объект.Ссылка);
	Иначе
		// записываем документ во временную папку
		ТабличныйДокумент = Документы.ВыплатыСамозанятым.РеестрДляВыгрузкиВExcel(Объект.Ссылка);
		ТабличныйДокумент.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLS97);
	КонецЕсли;
	
	Возврат ПолноеИмяФайла;
	
КонецФункции

&НаСервере
Функция ПоместитьФайлВоВременноеХранилищеНаСервере()
	
	Папка = ПолучитьИмяВременногоФайла();
	СоздатьКаталог(Папка);
	
	ЭтоВыгрузкаВCSV = ИнтеграцияСБанкамиПовтИсп.ЭтоСчетСбербанка(Объект.СчетОрганизации);
	
	ИмяФайла = СтрШаблон(НСтр("ru = 'Реестр выплат самозанятым № %1 от %2.%3'"), 
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Объект.Номер, Истина, Истина), 
		Формат(Объект.Дата, "ДФ='d MMMM'"),
		?(ЭтоВыгрузкаВCSV, "csv", "xls"));
	
	ПолноеИмяФайла = ПодготовитьФайл(Папка, ИмяФайла, ЭтоВыгрузкаВCSV);
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
	ПутьВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	ОписаниеФайла = Новый Структура;
	ОписаниеФайла.Вставить("Представление", ИмяФайла);
	ОписаниеФайла.Вставить("АдресВоВременномХранилище", ПутьВоВременномХранилище);
	ОписаниеФайла.Вставить("ЭтоВыгрузкаВCSV", ЭтоВыгрузкаВCSV);

	УдалитьВременныйФайлНаСервер(Папка);
	
	Возврат ОписаниеФайла;
	
КонецФункции

&НаСервере
Процедура УдалитьВременныйФайлНаСервер(ИмяФайла)
	
	Если Не ЗначениеЗаполнено(ИмяФайла) Тогда
		Возврат;
	КонецЕсли;
	
	// Удалим временный файл.
	Попытка
		УдалитьФайлы(ИмяФайла);
	Исключение
		СведенияОбОшибке = ИнформацияОбОшибке();
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось удалить временный файл по причине: %1'"),
			ПодробноеПредставлениеОшибки(СведенияОбОшибке));
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Выплаты самозанятым. Выгрузка реестра в Excel.'", 
			ОбщегоНазначения.КодОсновногоЯзыка()), 
			УровеньЖурналаРегистрации.Ошибка, , , 
			ТекстСообщения);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВФайлЗавершение(Подключено, ОписаниеФайла) Экспорт
	
	Если Не Подключено Тогда
		ПолучитьФайл(ОписаниеФайла.АдресВоВременномХранилище, ОписаниеФайла.Представление, Истина);
		Закрыть();
		Возврат;
	КонецЕсли;
	
	ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогСохраненияФайла.ПолноеИмяФайла = ОписаниеФайла.Представление;
	Если ОписаниеФайла.ЭтоВыгрузкаВCSV Тогда
		Фильтр = НСтр("ru = 'CSV (разделитель - точки с запятой)|*.csv'");
	Иначе
		Фильтр = НСтр("ru = 'Лист Excel|*.xls'");
	КонецЕсли;
	ДиалогСохраненияФайла.Фильтр = Фильтр;
	ДиалогСохраненияФайла.МножественныйВыбор = Ложь;
	ДиалогСохраненияФайла.Заголовок = НСтр("ru = 'Укажите путь сохранения реестра'");
	
	Обработчик = Новый ОписаниеОповещения("ВыгрузитьФайлВыборФайла", ЭтотОбъект, ОписаниеФайла);
	ДиалогСохраненияФайла.Показать(Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайлВыборФайла(ВыбранныеФайлы, ОписаниеФайла) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		
		ПолноеИмяФайла = ВыбранныеФайлы[0];
		
		ПолучаемыеФайлы = Новый Массив;
		ПолучаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ПолноеИмяФайла, ОписаниеФайла.АдресВоВременномХранилище));
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыгрузитьФайлВыборФайлаЗавершение", ЭтотОбъект, ОписаниеФайла);
		
		НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы, ПолноеИмяФайла, Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайлВыборФайлаЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт

	Если ПолученныеФайлы = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'При сохранении возникла ошибка'"));
	Иначе
		УстановитьСтатусДокумента(ПредопределенноеЗначение("Перечисление.СтатусыДокументовВыплатыСамозанятым.Выгружено"));			
		Состояние = ПредопределенноеЗначение("Перечисление.СтатусыДокументовВыплатыСамозанятым.Выгружено");
		Оповестить("Запись_ВыплатыСамозанятым", , Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатусДокумента(Состояние)
	
	НовыеСтатусыДокумента = РегистрыСведений.СтатусыДокументов.НовыеСтатусыДокумента();
	НовыеСтатусыДокумента.Статус = Состояние;
	РегистрыСведений.СтатусыДокументов.УстановитьСтатусыДокумента(Объект.Ссылка, НовыеСтатусыДокумента);
	
КонецПроцедуры

#КонецОбласти

#Область ЗагрузкаИзФайла

&НаКлиенте
Процедура ЗавершитьЗагрузкуИзФайла(АдресЗагруженныхДанных, НеиспользуемыйПараметр) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперация = ЗаполнитьТабличнуюЧастьВФоне(АдресЗагруженныхДанных);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗаполнитьТабличнуюЧастьЗавершение", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТабличнуюЧастьВФоне(АдресЗагруженныхДанных)
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("ЗагруженныеДанные", ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных));
	ПараметрыОбработки.Вставить("РеестрВыплат", Объект.Ссылка);
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(
		"ВыплатыСамозанятым.ЗаполнитьТабличнуюЧасть",
		ПараметрыОбработки,
		ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТабличнуюЧастьЗавершение(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Если ДлительнаяОперация.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ДлительнаяОперация.ПодробноеПредставлениеОшибки);
	Иначе
		Прочитать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти

#Область СчетаУчетаЗатрат

&НаСервере
Процедура ЗаполнитьОшибкуСчетаОрганизации()
	
	РезультатПроверкиСчета = БанковскиеСчетаСервер.ПроверитьКорректностьБанковскогоСчета(Объект.СчетОрганизации,
		Объект.Дата);
	Если РезультатПроверкиСчета.ЕстьОшибки Тогда
		ПризнакСчета = БанковскиеСчетаСервер.НовыйПризнакСчета();
		ПризнакСчета.СчетОрганизации = Истина;
		ОшибкаСчетаОрганизации = БанковскиеСчетаСервер.ТекстОшибкиБанковскогоСчета(РезультатПроверкиСчета, ПризнакСчета);
	Иначе
		ОшибкаСчетаОрганизации = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтобразитьПредупрежденияОбОшибкахСчетаОрганизации(Форма)
	
	Элементы = Форма.Элементы;
	
	Если ЗначениеЗаполнено(Форма.ОшибкаСчетаОрганизации) Тогда
		Элементы.ГруппаСчетОрганизацииПроверка.ЦветФона = Форма.ЦветОшибкиБанковскогоСчета;
		Если Не Форма.ИспользоватьНесколькоБанковскихСчетовОрганизации Тогда
			#Если Сервер Тогда
			Форма.ТекстПредупрежденияСчетОрганизации = СтроковыеФункции.ФорматированнаяСтрока(
				ТекстПредупрежденияСчетОрганизации(),
				Форма.ОшибкаСчетаОрганизации);
			#Иначе
			Форма.ТекстПредупрежденияСчетОрганизации = СтроковыеФункцииКлиент.ФорматированнаяСтрока(
				ТекстПредупрежденияСчетОрганизации(),
				Форма.ОшибкаСчетаОрганизации);
			#КонецЕсли
		Иначе
			Форма.ТекстПредупрежденияСчетОрганизации = "";
		КонецЕсли;
		Элементы.СчетОрганизации.РасширеннаяПодсказка.Заголовок = Форма.ОшибкаСчетаОрганизации;
		Элементы.СчетОрганизации.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
	Иначе
		Элементы.ГруппаСчетОрганизацииПроверка.ЦветФона = Форма.ЦветОтсутствияОшибок;
		Форма.ТекстПредупрежденияСчетОрганизации = "";
		Элементы.СчетОрганизации.РасширеннаяПодсказка.Заголовок = "";
		Элементы.СчетОрганизации.ОтображениеПодсказки = ОтображениеПодсказки.Авто;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТекстПредупрежденияСчетОрганизации()
	
	Возврат НСтр("ru = '%1. Добавьте новый <a href=''СписокСчетовСсылка''>банковский счет</a>'");
	
КонецФункции

#КонецОбласти

&НаСервере
Процедура ПрочитатьДокументИОбновитьСостояние()
	
	Прочитать();
	Состояние = СостояниеДокумента(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФлагОплачено()
	
	Если Состояние = Перечисления.СтатусыДокументовВыплатыСамозанятым.Оплачено 
		Или Состояние = Перечисления.СтатусыДокументовВыплатыСамозанятым.ЧекиЗагружены Тогда
		// Все оплачено или чеки загружены, то значит все оплачено.
		// Ничего проверять не будем.
		ТаблицаВыплаты = Объект.Выплаты.Выгрузить();
		ТаблицаВыплаты.ЗаполнитьЗначения(Истина, "Оплачено");
		Объект.Выплаты.Загрузить(ТаблицаВыплаты);
		Возврат;
	КонецЕсли;
	
	Если Не (Состояние = Перечисления.СтатусыДокументовВыплатыСамозанятым.ЧастичноОплачено 
		Или Состояние = Перечисления.СтатусыДокументовВыплатыСамозанятым.ЧекиЧастичноЗагружены) Тогда
		// Если еще не было оплаты или загрузки чеков, то значит ничего не оплачено
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗадолженностьСамозанятыхПоРееструОстатки.Контрагент КАК Контрагент,
	|	ЗадолженностьСамозанятыхПоРееструОстатки.СуммаОстаток КАК Сумма
	|ИЗ
	|	РегистрНакопления.РасчетыСПрочимиКонтрагентами.Остатки(
	|			,
	|			Организация = &Организация
	|				И Документ = &Ссылка) КАК ЗадолженностьСамозанятыхПоРееструОстатки";
	ТаблицаОстатков = Запрос.Выполнить().Выгрузить();
	
	ТаблицаВыплаты = Объект.Выплаты.Выгрузить();
	ТаблицаВыплаты.ЗаполнитьЗначения(Истина, "Оплачено");
	Для Каждого Строка Из ТаблицаОстатков Цикл
		// Найдем только задолженность и снимем флаг Оплачено
		Если Строка.Сумма = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ОтборСтрок = Новый Структура("Контрагент, БанковскийСчет, Сумма");
		ЗаполнитьЗначенияСвойств(ОтборСтрок, Строка);
		
		СтрокаТаблицы = ТаблицаВыплаты.Найти(ОтборСтрок);
		Если СтрокаТаблицы <> Неопределено Тогда
			СтрокаТаблицы.Оплачено = Ложь;
			Строка.Сумма = 0;
		Иначе
			// Сумма не совпадает. В этом случае может быть несколько вариантов:
			// 1. Несколько строк с одним контрагентом и счетом
			// 2. Оплата была на другую сумму, чем задолженность
		
			ОтборСтрок.Удалить("Сумма");
			СтрокиТаблицы = ТаблицаВыплаты.НайтиСтроки(ОтборСтрок);
			
			Если СтрокиТаблицы = Неопределено Тогда
				// Этого самозанятого нет в документе. Ситуация маловероятная, никак ее не обрабатываем.
				Продолжить;
			ИначеЕсли СтрокиТаблицы.Количество() = 1 Тогда
				// Самозанятый только один, но задолженность полностью не погашена
				СтрокиТаблицы[0].Оплачено = Ложь;
			Иначе
				// Несколько строк с одним и тем же самозанятым
				ЗадолженностьСамозанятого = 0;
				Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
					ЗадолженностьСамозанятого = ЗадолженностьСамозанятого + СтрокаТаблицы.Сумма;
					СтрокаТаблицы.Оплачено = Ложь;
				КонецЦикла;
				// Рассчитаем, сколько уже оплатили самозанятому и погасим подходящие строки
				СуммаОплаты = ЗадолженностьСамозанятого - Строка.Сумма;
				Для Каждого СтрокаТаблицы Из СтрокиТаблицы Цикл
					Если СуммаОплаты = 0 Тогда
						Прервать;
					КонецЕсли;
					Если СтрокаТаблицы.Сумма <= СуммаОплаты Тогда
						СтрокаТаблицы.Оплачено = Истина;
						СуммаОплаты = СуммаОплаты - СтрокаТаблицы.Сумма;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Объект.Выплаты.Загрузить(ТаблицаВыплаты);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СостояниеДокумента(Ссылка)
	
	МассивДокументов = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылка);
	КоллекцияСтатусов = РегистрыСведений.СтатусыДокументов.ПолучитьСтатусыДокументов(МассивДокументов);
	Возврат ?(КоллекцияСтатусов[Ссылка] <> Неопределено, КоллекцияСтатусов[Ссылка].Статус, Неопределено);
	
КонецФункции

&НаСервере
Процедура СчетОрганизацииПриИзмененииНаСервере()
	
	ЗаполнитьОшибкуСчетаОрганизации();
	
	Если ЗначениеЗаполнено(Объект.СчетОрганизации) Тогда
		ПодключенаИнтеграцияСБанком = ЕстьНастройкаИнтеграцииСБанком();
	Иначе
		ПодключенаИнтеграцияСБанком = Ложь;
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПараметрыВыбораСчетаОрганизации()
	
	МассивПараметров = Новый Массив();
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ЦифровойСчет", Ложь));
	
	Элементы.СчетОрганизации.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти = Неопределено, ПараметрыРасчета = Неопределено)
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы.Выплаты.ТекущиеДанные;
	КонецЕсли;
	
	Если ПараметрыРасчета = Неопределено Тогда
		ПараметрыРасчета = Новый Структура();
	КонецЕсли;
	
	ПараметрыРасчета.Вставить("РассчитатьСуммуСкидки", Ложь);
	ПараметрыРасчета.Вставить("СброситьФлагСкидкиРассчитаны", Ложь);

	ТабличныеЧастиУНФКлиент.РассчитатьСуммыВСтрокеТЧ(СтрокаТабличнойЧасти, ПараметрыРасчета);
	
КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()

&НаСервере
Процедура ПолучитьЗапасыИзХранилища(АдресЗапасовВХранилище, ИмяТабличнойЧасти, ЕстьХарактеристики, ЕстьПартии,
	МассивНомеровИдентичныхСтрок = Неопределено)
	
	ТаблицаДляЗагрузки = ПолучитьИзВременногоХранилища(АдресЗапасовВХранилище);
	
	// Объединение строк
	ЕстьЦенаВТабличнойЧасти = ДокументыУНФ.ЕстьЦенаВТабличнойЧасти(Объект, ИмяТабличнойЧасти);
	
	СтруктурыПоискаИдентичныхСтрок = ДокументыУНФ.СтруктурыПоискаИдентичныхСтрок(Объект, ТаблицаДляЗагрузки,
		ИмяТабличнойЧасти);
	СтруктураПоискаСЦеной = СтруктурыПоискаИдентичныхСтрок.СтруктураПоискаСЦеной;
	СтруктураПоискаБезЦены = СтруктурыПоискаИдентичныхСтрок.СтруктураПоискаБезЦены;
	
	ОбъединятьСтроки = ОбъединятьСтрокиПриДобавлении И Не МассивНомеровИдентичныхСтрок = Неопределено;
	
	Для каждого СтрокаЗагрузки Из ТаблицаДляЗагрузки Цикл
		
		Если ОбъединятьСтроки Тогда
			
			Если НЕ ЗначениеЗаполнено(СтрокаЗагрузки.Цена) 
				Или Не ЕстьЦенаВТабличнойЧасти Тогда
				СтруктураПоиска = СтруктураПоискаБезЦены;
			Иначе
				СтруктураПоиска = СтруктураПоискаСЦеной;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(СтруктураПоиска, СтрокаЗагрузки);
			НайденныеСтроки = Объект[ИмяТабличнойЧасти].НайтиСтроки(СтруктураПоиска);
			
			Если НайденныеСтроки.Количество() Тогда
				НайденныеСтроки[0].Количество = НайденныеСтроки[0].Количество + СтрокаЗагрузки.Количество;
				МассивНомеровИдентичныхСтрок.Добавить(НайденныеСтроки[0].НомерСтроки - 1);
				Продолжить;
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяСтрока = Объект[ИмяТабличнойЧасти].Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
		
	КонецЦикла; 
	
	ЦенообразованиеСервер.ДобавитьКолонкуИЗаполнитьМинимальныеЦеныВТЧ(ЭтотОбъект, ИмяТабличнойЧасти, Истина);
	
КонецПроцедуры // ПолучитьЗапасыИзХранилища()

&НаСервереБезКонтекста
Функция ПолучитьНастройкиИзмененияКоличества()
	
	НастройкиКоличества = ДокументыУНФКлиентСервер.ПараметрыСбросаКоличества();
	ДокументыУНФ.ЗаполнитьНастройкиКоличества(НастройкиКоличества);
	Возврат НастройкиКоличества;
	
КонецФункции

#КонецОбласти
